<?php
/**
 * @author: Yudu <uicosp@gmail.com>
 * @date: 2017/1/10
 */

return [
    /*
    |--------------------------------------------------------------------------
    | 自身凭证
    |--------------------------------------------------------------------------
    |
    | 在此处配置自身在调用其他系统服务时需要的凭证
    |
    */

    'cas' => ['service_key' => 'caskey', 'service_secret' => 'cassecret'],
    'payment' => ['service_key' => '', 'service_secret' => ''],
    //...

    /*
    |--------------------------------------------------------------------------
    | 客户端凭证
    |--------------------------------------------------------------------------
    |
    | 在此处配置允许访问本系统服务的所有客户端
    |
    */

    'clients' => [
        // {service_key} => {service_secret}
        'key123' => 'secret456',
    ],

    /*
    |--------------------------------------------------------------------------
    | 签名的有效时间
    |--------------------------------------------------------------------------
    |
    | 在客户端调用本系统服务时需要检查时戳的有效时间
    |
    */

    'expires_in' => env('SERVICE_SIGNATURE_EXPIRES_IN', 10),
];
